spec/fixtures/ipn/express_checkout.json

{
  "mc_gross":"9.00",
  "invoice":"1234",
  "protection_eligibility":"Ineligible",
  "payer_id":"6KAQNBYBZ6KAC",
  "tax":"0.00",
  "payment_date":"20:37:01 Jul 04, 2011 PDT",
  "payment_status":"Completed",
  "charset":"windows-1252",
  "first_name":"Test",
  "mc_fee":"0.56",
  "notify_version":"3.1",
  "custom":"1234",
  "payer_status":"verified",
  "quantity":"1",
  "verify_sign":"AZP9aUnslyCXgo2.9xWwtk8th8HXAnLqF6TgvmD3ME7fM.iCQhnQ0iRS",
  "payer_email":"buyer_1309779460_per@simplesideias.com.br",
  "txn_id":"8JD75017U43409907",
  "payment_type":"instant",
  "last_name":"User",
  "receiver_email":"seller_1308793919_biz_api1.simplesideias.com.br",
  "payment_fee":"0.56",
  "receiver_id":"GSZCRUB62BL5L",
  "txn_type":"express_checkout",
  "item_name":"Awesome - Monthly Subscription",
  "mc_currency":"USD",
  "item_number":"",
  "residence_country":"US",
  "test_ipn":"1",
  "handling_amount":"0.00",
  "transaction_subject":"",
  "payment_gross":"9.00",
  "shipping":"0.00",
  "ipn_track_id":"sAEWZiSm95ZxQfYHq-RE8w"
}