spec/fixtures/ipn/recurring_payment.json

{
  "mc_gross":"9.00",
  "period_type":" Regular",
  "outstanding_balance":"0.00",
  "next_payment_date":"03:00:00 Jul 06, 2011 PDT",
  "protection_eligibility":"Ineligible",
  "payment_cycle":"Daily",
  "tax":"0.00",
  "payer_id":"6KAQNBYBZ6KAC",
  "payment_date":"03:06:59 Jul 05, 2011 PDT",
  "payment_status":"Completed",
  "product_name":"Awesome - Monthly Subscription",
  "charset":"windows-1252",
  "rp_invoice_id":"1234",
  "recurring_payment_id":"I-E9EJKE50EPPY",
  "first_name":"Test",
  "mc_fee":"0.56",
  "notify_version":"3.1",
  "amount_per_cycle":"9.00",
  "payer_status":"verified",
  "currency_code":"USD",
  "business":"seller_1308793919_biz_api1.simplesideias.com.br",
  "verify_sign":"A31F-vcNTWfrBDr18m0ZsQO28jDTAvPYHS7RmO4dZDD-ObUm6mgY-vS1",
  "payer_email":"buyer_1309779460_per@simplesideias.com.br",
  "initial_payment_amount":"0.00",
  "profile_status":"Active",
  "amount":"9.00",
  "txn_id":"8UT11014H0627171P",
  "payment_type":"instant",
  "last_name":"User",
  "receiver_email":"seller_1308793919_biz_api1.simplesideias.com.br",
  "payment_fee":"0.56",
  "receiver_id":"GSZCRUB62BL5L",
  "txn_type":"recurring_payment",
  "mc_currency":"USD",
  "residence_country":"US",
  "test_ipn":"1",
  "transaction_subject":"",
  "payment_gross":"9.00",
  "shipping":"0.00",
  "product_type":"1",
  "time_created":"20:37:06 Jul 04, 2011 PDT",
  "ipn_track_id":"ZuDCTZrTVSGEOmiIJmdZ8Q"
}