spec/fixtures/ipn/recurring_payment_profile_created.json

{
  "payment_cycle":"Daily",
  "txn_type":"recurring_payment_profile_created",
  "last_name":"User",
  "next_payment_date":"03:00:00 Jul 05, 2011 PDT",
  "residence_country":"US",
  "initial_payment_amount":"0.00",
  "rp_invoice_id":"1234",
  "currency_code":"USD",
  "time_created":"20:37:06 Jul 04, 2011 PDT",
  "verify_sign":"AKAZgvqH1r0IxFcG2KYlwYC.bd7rAhHiMcfsQu1D8ouxLCbt2THiAy6E",
  "period_type":" Regular",
  "payer_status":"verified",
  "test_ipn":"1",
  "tax":"0.00",
  "payer_email":"buyer_1309779460_per@simplesideias.com.br",
  "first_name":"Test",
  "receiver_email":"seller_1308793919_biz_api1.simplesideias.com.br",
  "payer_id":"6KAQNBYBZ6KAC",
  "product_type":"1",
  "shipping":"0.00",
  "amount_per_cycle":"9.00",
  "profile_status":"Active",
  "charset":"windows-1252",
  "notify_version":"3.1",
  "amount":"9.00",
  "outstanding_balance":"0.00",
  "recurring_payment_id":"I-E9EJKE50EPPY",
  "product_name":"Awesome - Monthly Subscription",
  "ipn_track_id":"aWXcwC-7TDo7InmzVuuRrQ"
}